Revit 2027 API
Selection.PickObjects(ObjectType, String) Method
Prompts the user to select multiple objects while showing a custom status prompt string.
Namespace: Autodesk.Revit.UI.Selection
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Reference> PickObjects(
	ObjectType objectType,
	string statusPrompt
)
Public Function PickObjects (
	objectType As ObjectType,
	statusPrompt As String
) As IList(Of Reference)
public:
IList<Reference^>^ PickObjects(
	ObjectType objectType,
	String^ statusPrompt
)
member PickObjects :
        objectType : ObjectType *
        statusPrompt : string -> IList<Reference>
Parameters
objectType ObjectType
Specifies the type of object to be selected.
statusPrompt String
The message shown on the status bar.
Return Value
IList<Reference>
A collection of references selected by the user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | Thrown when the objectType is not a recognized value.
ArgumentNullException | Thrown when the statusPrompt is null.
OperationCanceledException | Thrown when the Revit user cancelled this operation. Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
ForbiddenForDynamicUpdateException | Thrown if this method is called during dynamic update.
Remarks
>
The user will be shown "Finish" and "Cancel" buttons on the dialog bar to complete the selection operation. Uncheck the "Multiple" check-box to select single object and it will return the selected object directly.
Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view), but will not be permitted to click other items in the Revit user interface. Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
The selection will not be automatically added to the active selection buffer.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
See Also
Reference
Selection Class
PickObjects Overload
Autodesk.Revit.UI.Selection Namespace